import './Oblepiha.css'
import FadeInText from "../FadeInText";

export default function Oblepiha(){
    return(
        <section id='oblepiha' className='section window2' style={{ backgroundImage: `url(../../hippophae.png)`}}>
            <FadeInText>
            <h2>Облепиха</h2>
            <p>Облепиха (Hippophae rhamnoides) — это кустарник или небольшое дерево, принадлежащее к семейству
                Elaeagnaceae. Оно широко распространено в Европе и Азии, особенно в прибрежных и степных зонах.
                Облепиха известна своими ярко-оранжевыми ягодами, которые богаты витаминами (особенно витамином C),
                антиоксидантами и полезными жирными кислотами.</p>
            <p>Растение характеризуется колючими ветвями, мелкими листьями и яркими ягодами, которые образуются
                в кистях. Облепиха используется в кулинарии для приготовления соков, джемов и косметических средств,
                а также в народной медицине для укрепления иммунной системы и улучшения состояния кожи.</p>
            <p>Облепиха также ценится за свои защитные свойства, так как она помогает предотвращать эрозию почвы и
                улучшает качество почвы благодаря своим корневым системам. Растение неприхотливо и может расти в
                различных условиях, включая бедные и песчаные почвы.</p>
            <h3>Калорийность и БЖУ облепихи</h3>
            <p>Полезная суточная норма облепихи составляет 50-100 г в день. При этом на 100г продукта приходится 82 ккал. В 100 г</p>
            <ul>
                <li>белков — 1,2 г;</li>
                <li>жиров — 5,4 г;</li>
                <li>углеводов — 5,7 г.</li>
            </ul>
            <h3>Содержит витамины и микроэлементы</h3>
            <ul>
                <li>витамин С — 200 мг;</li>
                <li>бета-каротин — 1,5 мг;</li>
                <li>витамин Е — 5 мг;</li>
                <li>марганец — 0,93 мг;</li>
                <li>медь — 240 мкг.</li>
            </ul>
            </FadeInText>
        </section>
    )
}